
const nothonmeal = [
    '국수파동',
    '꼬꼬아찌치킨',
    '꾸이꾸이',
    '내가찜한닭',
    '노랑통닭',
    '놀부 부대찌개',
    '닭스데이',
    '도미노피자',
    '동네아저씨치킨',
    '땅땅치킨',
    '매운 갈비찜',
    '멕시카나',
    '명동 찌개 마을',
    'BBQ',
    '성대 찌개고을',
    '셰프의 부대찌개',
    '썬더치킨',
    '아웃닭',
    '59쌀 피자',
    '옥집',
    '월매랑 삼겹이랑',
    '우리집',
    '육앤샤(숯불 꼬치구이)',
    '일미',
    '지코바',
    '찌개지존',
    '청년다방',
    '청년밥상',
    '충만치킨',
    '콩마을',
    '파불고기',
    '피자스쿨',
    '한두야 밥먹자',
    '한마리 정육식당',
    '항아리보쌈',
    '황금족발'
];

const honmeal = [
    '가마타케 제면소',
    '고칸',
    '고씨네',
    '고아사',
    '공대식당',
    '국수나무',
    '귀신반점',
    '낮것상 칼국수',
    '더 진국',
    '덮밥의 정석',
    '도스마스',
    '돈키호테',
    '동자 설렁탕',
    '마닭',
    '마루 회덮밥',
    '만다 김밥',
    '맘스터치',
    '매콤 돈가스',
    '맥도날드',
    '명동 돈가스',
    '미가',
    '미스사이공',
    '민손짜장',
    '밀 플랜비',
    '반갑다 친구야',
    '백령도 생 바지락 칼국수',
    '본찌 돈가스',
    '벨라튀니지아',
    '사우스 스트리트',
    '성대밥상',
    '생각나는 순대국',
    '알촌',
    '왕 돈까스',
    '예국향',
    '옛 이야기',
    '오 닭꼬치',
    '육소담',
    '1인자 감자탕',
    '짱 식당',
    '천하일면',
    '청년 짬뽕',
    '청진동 해장국',
    '키와마루아지',
    '토마토 도시락',
    '편의점 도시락',
    '학생회관 식당',
    '한솥 도시락',
    '한식당',
    '할매순대',
    '히토리',
    '마포구이촌',
    '볏집 통삼겹살',
    '성대 고깃간',
    '성대 양꼬치',
    '명가 양꼬치',
    '엉터리 생고기',
    '인생 삼겹',
    '짬뽕타임'
];

const dining = [
    '감스시',
    '고기굽는교실',
    '곱창고',
    '곱창생각',
    '마왕족발',
    '마포갈비',
    '생고기 제작소',
    '성대목장',
    '스시뽕',
    '싱싱회센타',
    '오징어 나라',
    '찬이네 주먹고기',
    '제주도야지생삼겹',
    '춘천 닭갈비',
    '택이네 조개 전골',
    '포동이네',
    '홍매 스시',
    '황소마을 곱창'
]

const meal = nothonmeal.concat(honmeal);



function response(room, msg, sender, isGroupChat, replier, ImageDB) {

    if (msg == '라라밥')
    {
        var selected = Math.floor(Math.random() * (meal.length));
        replier.reply('알겠슘돠!\n[' + meal[selected] + ']');
    }

    if (msg == '라라혼밥')
    {
        var selected = Math.floor(Math.random() * (honmeal.length));
        replier.reply('알겠슘돠!\n[' + honmeal[selected] + ']');
    }

    if (msg == '라라회식')
    {
        var selected = Math.floor(Math.random() * (dining.length));
        replier.reply('알겠슘돠!\n[' + dining[selected] + ']');
    }

    if (msg == '라라밥 리스트')
    {
        replier.reply(nothonmeal);
        replier.reply(honmeal);
        replier.reply(dining);
    }

}
